espressif/binutils-esp32ulp/gas/config/tc-esp32s2ulp.c
static parse_state
parse(char *line)
{
	parse_state state;
	YY_BUFFER_STATE buffstate;

	buffstate = yy_scan_string(line);

	/* our lex requires setting the start state to keyword
	every line as the first word may be a keyword.
	Fixes a bug where we could not have keywords as labels.  */
	set_start_state();

	/* Call yyparse here.  */
	//DEBUG_TRACE("yyparse: %s\n", line);
	state = yyparse();
	//DEBUG_TRACE("yyparse result!: %i\n", (int)state);
	if (state == SEMANTIC_ERROR)
	{
		as_bad(_("Parse failed."));
		//DEBUG_TRACE("yyparse ERROR!: %s\n", line);
		insn = 0;
	}

	yy_delete_buffer(buffstate);
	return state;
}

/* We need to handle various expressions properly.
Such as, [SP--] = 34, concerned by md_assemble().  */

void
md_operand(expressionS * expressionP)
{
	if (*input_line_pointer == '[')
	{
		as_tsktsk("We found a '['!");
		input_line_pointer++;
		expression(expressionP);
	}
}

/* Handle undefined symbols. */
symbolS *
md_undefined_symbol(char *name ATTRIBUTE_UNUSED)
{
	return (symbolS *)0;
}

int
md_estimate_size_before_relax(fragS * fragP ATTRIBUTE_UNUSED,
segT segment ATTRIBUTE_UNUSED)
{
	return 0;
}

long check_reg_range(fixS* fixP, long value);

long check_reg_range(fixS* fixP, long value)
{
	long result = value;
	if ((value > DR_REG_MAX_DIRECT) || (value < 0)){
		if ((value >= DR_REG_RTCCNTL_BASE) && (value < DR_REG_IO_MUX_BASE)){
			result = (value - DR_REG_RTCCNTL_BASE)/4;
		} else {
			as_bad_where(fixP->fx_file, fixP->fx_line, _("Register address out of range. Must be in range of 0..0x3ff or 0x3ff48000..0x3ff49000."));
		}
	}
	return result;
}



/* Round up a section size to the appropriate boundary.  */
valueT
md_section_align(segT segment, valueT size)
{
	int boundary = bfd_get_section_alignment(stdoutput, segment);
	return ((size + (1 << boundary) - 1) & -(1 << boundary));
}


const char *
md_atof(int type, char * litP, int * sizeP)
{
	return ieee_md_atof(type, litP, sizeP, FALSE);
}


/* If while processing a fixup, a reloc really needs to be created
then it is done here.  */

arelent *
tc_gen_reloc(asection *seg ATTRIBUTE_UNUSED, fixS *fixp)
{
	arelent *reloc;

	reloc = XNEW(arelent);
	reloc->sym_ptr_ptr = XNEW(asymbol *);
	*reloc->sym_ptr_ptr = symbol_get_bfdsym(fixp->fx_addsy);
	reloc->address = fixp->fx_frag->fr_address + fixp->fx_where;
	
	//reloc->address = reloc->address / 4;

	reloc->addend = fixp->fx_offset;
	reloc->howto = bfd_reloc_type_lookup(stdoutput, fixp->fx_r_type);
	
	//DEBUG_TRACE("tc_gen_reloc - reloc->address =%08x, symvalue=%08x, seg->flags=%08x, name=%s\n", (unsigned int)reloc->address, (unsigned int)(*reloc->sym_ptr_ptr)->value, (unsigned int)seg->flags, (*reloc->sym_ptr_ptr)->name);

	if (reloc->howto == (reloc_howto_type *)NULL)
	{
		as_bad_where(fixp->fx_file, fixp->fx_line,
			/* xgettext:c-format.  */
			_("reloc %d not supported by object file format"),
			(int)fixp->fx_r_type);

		xfree(reloc);

		return NULL;
	}

	return reloc;
}

/*  The location from which a PC relative jump should be calculated,
given a PC relative reloc.  */

long
md_pcrel_from_section(fixS *fixP, segT sec)
{
	if (fixP->fx_addsy != (symbolS *)NULL
		&& (!S_IS_DEFINED(fixP->fx_addsy)
		|| S_GET_SEGMENT(fixP->fx_addsy) != sec))
	{
		/* The symbol is undefined (or is defined but not in this section).
		Let the linker figure it out.  */
		return 0;
	}
	return fixP->fx_frag->fr_address + fixP->fx_where;
}

INSTR_T
note_reloc(INSTR_T code, Expr_Node * symbol, int reloc, int pcrel)
{
	/* Assert that the symbol is not an operator.  */
	gas_assert(symbol->type == Expr_Node_Reloc);

	return note_reloc1(code, symbol->value.s_value, reloc, pcrel);

}

INSTR_T
note_reloc1(INSTR_T code, const char *symbol, int reloc, int pcrel)
{
	code->reloc = reloc;
	code->exp = mkexpr(0, symbol_find_or_make(symbol));
	code->pcrel = pcrel;
	return code;
}

INSTR_T
note_reloc2(INSTR_T code, const char *symbol, int reloc, int value, int pcrel)
{
	code->reloc = reloc;
	code->exp = mkexpr(value, symbol_find_or_make(symbol));
	code->pcrel = pcrel;
	return code;
}

/* Special extra functions that help esp32ulp-parse.y perform its job.  */

struct obstack mempool;

INSTR_T
conscode(INSTR_T head, INSTR_T tail)
{
	if (!head)
		return tail;
	head->next = tail;
	return head;
}

INSTR_T
conctcode(INSTR_T head, INSTR_T tail)
{
	INSTR_T temp = (head);
	if (!head)
		return tail;
	while (temp->next)
		temp = temp->next;
	temp->next = tail;

	return head;
}

int reloc;
int ninsns;
int count_insns;

static void *
allocate(size_t n)
{
	return obstack_alloc(&mempool, n);
}

Expr_Node *
Expr_Node_Create(Expr_Node_Type type,
Expr_Node_Value value,
Expr_Node *Left_Child,
Expr_Node *Right_Child)
{


	Expr_Node *node = (Expr_Node *)allocate(sizeof(Expr_Node));
	node->type = type;
	node->value = value;
	node->Left_Child = Left_Child;
	node->Right_Child = Right_Child;
	return node;
}

static const char *con = ".__constant";
static const char *op = ".__operator";
static INSTR_T Expr_Node_Gen_Reloc_R(Expr_Node * head);
INSTR_T Expr_Node_Gen_Reloc(Expr_Node *head, int parent_reloc);


// Conditions for JUMPS instructions
#define JUMPS_EQ 3 
#define JUMPS_GT 4
#define JUMPS_LE 2
#define JUMPS_LT 0
#define JUMPS_GE 1

// Step to reach next instruction
#define NEXT_INSTRUCTION_STEP  4

#ifdef OBJ_FDPIC_ELF
# define DEFAULT_FDPIC EF_ESP32S2ULP_FDPIC
#else
# define DEFAULT_FDPIC 0
#endif

static flagword esp32s2ulp_flags = DEFAULT_FLAGS | DEFAULT_FDPIC;

static void
esp32s2ulp_s_bss(int ignore ATTRIBUTE_UNUSED)
{
	int temp;

	temp = get_absolute_expression();
	subseg_set(bss_section, (subsegT)temp);
	demand_empty_rest_of_line();
}

const pseudo_typeS md_pseudo_table[] = {
	{ "align", s_align_bytes, 0 },
	{ "byte2", cons, 2 },
	{ "byte4", cons, 4 },
	{ "db", cons, 1 },
	{ "dd", cons, 4 },
	{ "dw", cons, 2 },
	{ "p", s_ignore, 0 },
	{ "pdata", s_ignore, 0 },
	{ "var", s_ignore, 0 },
	{ "bss", esp32s2ulp_s_bss, 0 },
	{ 0, 0, 0 }
};

unsigned int esp32s2ulp_anomaly_checks = 0;

/* Perform machine-specific initializations.  */
void
md_begin(void)
{
	/* Set the ELF flags if desired. */
	if (esp32s2ulp_flags)
		bfd_set_private_flags(stdoutput, esp32s2ulp_flags);

	/* Set the default machine type. */
	if (!bfd_set_arch_mach(stdoutput, bfd_arch_esp32s2ulp, 0))
		as_warn(_("Could not set architecture and machine."));

