espressif/binutils-esp32ulp/gas/config/tc-esp32s2ulp.c
		temp_val = 0;
		value &= 0xff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 10));
		temp_val |= (value << 10);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_REG_RW_DATA temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;

	case BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH:
		if ((value > 0x7) || (value < -0x7))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH"));
		temp_val = 0;
		value &= 0x7;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x7 << 19));
		temp_val |= (value << 19);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32S2ULP_I2C_RW_LOW:
		if ((value > 0x7) || (value < -0x7))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32S2ULP_I2C_RW_LOW"));
		temp_val = 0;
		value &= 0x7;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x7 << 16));
		temp_val |= (value << 16);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_I2C_RW_LOW temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32S2ULP_I2C_RW_SEL:
		if ((value > 0xf) || (value < -0xf))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32S2ULP_I2C_RW_SEL"));
		temp_val = 0;
		value &= 0xf;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xf << 22));
		temp_val |= (value << 22);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_I2C_RW_SEL temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR:
		if ((value > 0xff) || (value < -0xff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR"));
		temp_val = 0;
		value &= 0xff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32S2ULP_I2C_RW_DATA:
		if ((value > 0xff) || (value < -0xff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32S2ULP_I2C_RW_DATA"));
		temp_val = 0;
		value &= 0xff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 8));
		temp_val |= (value << 8);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_I2C_RW_DATA temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;

	default:
		fprintf(stderr, "Relocation %d not handled in gas." " Contact support.\n", fixP->fx_r_type);
		return;
		//if ((BFD_ARELOC_ESP32S2ULP_PUSH > fixP->fx_r_type) || (BFD_ARELOC_ESP32S2ULP_COMP < fixP->fx_r_type))
		//{
		//	fprintf(stderr, "Relocation %d not handled in gas." " Contact support.\n", fixP->fx_r_type);
		//	return;
		//}
	}

	if (!fixP->fx_addsy)
		fixP->fx_done = TRUE;

}

/* Return true if the fix can be handled by GAS, false if it must
be passed through to the linker.  */

bfd_boolean
esp32s2ulp_fix_adjustable(fixS *fixP)
{
	switch (fixP->fx_r_type)
	{
		/* Adjust_reloc_syms doesn't know about the GOT.  */
	case BFD_RELOC_ESP32S2ULP_GOT:
	case BFD_RELOC_ESP32S2ULP_PLTPC:
		/* We need the symbol name for the VTABLE entries.  */
	case BFD_RELOC_VTABLE_INHERIT:
	case BFD_RELOC_VTABLE_ENTRY:
		return 0;

	default:
		return 1;
	}
}



INSTR_T
gencode(unsigned long x)
{
	INSTR_T cell = XOBNEW(&mempool, struct esp32s2ulp_insn);
	memset(cell, 0, sizeof(struct esp32s2ulp_insn));
	cell->value = (x);
	return cell;
}


INSTR_T
Expr_Node_Gen_Reloc(Expr_Node * head, int parent_reloc)
{
	/* Top level reloction expression generator VDSP style.
	If the relocation is just by itself, generate one item
	else generate this convoluted expression.  */

	INSTR_T note = NULL_CODE;
	INSTR_T note1 = NULL_CODE;
	int pcrel = 1;  /* Is the parent reloc pcrelative?
					This calculation here and HOWTO should match.  */

	if (parent_reloc)
	{
		/*  If it's 32 bit quantity then 16bit code needs to be added.  */
		int value = 0;

		if (head->type == Expr_Node_Constant)
		{
			/* If note1 is not null code, we have to generate a right
			aligned value for the constant. Otherwise the reloc is
			a part of the basic command and the yacc file
			generates this.  */
			value = head->value.i_value;
		}
		switch (parent_reloc)
		{
			/*  Some relocations will need to allocate extra words.  */
		case BFD_RELOC_ESP32S2ULP_16_IMM:
		case BFD_RELOC_ESP32S2ULP_JUMPR:
		case BFD_RELOC_ESP32S2ULP_16_LOAD:
		case BFD_RELOC_ESP32S2ULP_WR_MEM:
		case BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL:
		case BFD_RELOC_ESP32S2ULP_ALUI:
		case BFD_RELOC_ESP32S2ULP_WAIT:
		case BFD_RELOC_ESP32S2ULP_TSENS_DELAY:
		case BFD_RELOC_ESP32S2ULP_WAKE:
		case BFD_RELOC_ESP32S2ULP_SLEEP:
		case BFD_RELOC_ESP32S2ULP_ADC_CYCLE:
		case BFD_RELOC_ESP32S2ULP_ADC_SEL:
		case BFD_RELOC_ESP32S2ULP_ADC_MUX:
		case BFD_RELOC_ESP32S2ULP_STAGE:
		//case BFD_RELOC_ESP32S2ULP_JUMPR_STEP:
		case BFD_RELOC_ESP32S2ULP_JUMPR_THRESH:
		case BFD_RELOC_ESP32S2ULP_JUMPS_THRESH:
		case BFD_RELOC_ESP32S2ULP_REG_RW_HIGH:
		case BFD_RELOC_ESP32S2ULP_REG_RW_LOW:
		case BFD_RELOC_ESP32S2ULP_REG_RW_ADDR:
		case BFD_RELOC_ESP32S2ULP_REG_RW_DATA:
        case BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH:
        case BFD_RELOC_ESP32S2ULP_I2C_RW_LOW:
        case BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR:
        case BFD_RELOC_ESP32S2ULP_I2C_RW_DATA:
        case BFD_RELOC_ESP32S2ULP_I2C_RW_SEL:
			note1 = conscode(gencode(value), NULL_CODE);
			pcrel = 0;
			break;
		case BFD_RELOC_16:
		case BFD_RELOC_24:
		case BFD_RELOC_32:
			note1 = conscode(gencode(value), NULL_CODE);
			pcrel = 0;
			break;
		default:
			note1 = NULL_CODE;
		}
	}
	if (head->type == Expr_Node_Constant)
		note = note1;
	else if (head->type == Expr_Node_Reloc)
	{
		note = note_reloc1(gencode(0), head->value.s_value, parent_reloc, pcrel);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
	}
	else if (head->type == Expr_Node_Binop
		&& (head->value.op_value == Expr_Op_Type_Add
		|| head->value.op_value == Expr_Op_Type_Sub)
		&& head->Left_Child->type == Expr_Node_Reloc
		&& head->Right_Child->type == Expr_Node_Constant)
	{
		int val = head->Right_Child->value.i_value;
		if (head->value.op_value == Expr_Op_Type_Sub)
			val = -val;
		note = conscode(note_reloc2(gencode(0), head->Left_Child->value.s_value,
			parent_reloc, val, 0),
			NULL_CODE);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
	}
	else
	{
		/* Call the recursive function.  */
		note = note_reloc1(gencode(0), op, parent_reloc, pcrel);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
		note = conctcode(Expr_Node_Gen_Reloc_R(head), note);
	}
	return note;
}

