espressif/binutils-esp32ulp/gas/config/tc-esp32s2ulp.c
static INSTR_T
Expr_Node_Gen_Reloc_R(Expr_Node * head)
{

	INSTR_T note = 0;
	INSTR_T note1 = 0;

	switch (head->type)
	{
	case Expr_Node_Constant:
		note = conscode(note_reloc2(gencode(0), con, BFD_ARELOC_ESP32S2ULP_CONST, head->value.i_value, 0), NULL_CODE);
		break;
	case Expr_Node_Reloc:
		note = conscode(note_reloc(gencode(0), head, BFD_ARELOC_ESP32S2ULP_PUSH, 0), NULL_CODE);
		break;
	case Expr_Node_Unop:
		note1 = conscode(Expr_Node_Gen_Reloc_R(head->Left_Child), NULL_CODE);
		switch (head->value.op_value)
		{
		case Expr_Op_Type_NEG:
			note = conctcode(note1, conscode(note_reloc1(gencode(0), op, BFD_ARELOC_ESP32S2ULP_NEG, 0), NULL_CODE));
			break;
		case Expr_Op_Type_COMP:
			note = conctcode(note1, conscode(note_reloc1(gencode(0), op, BFD_ARELOC_ESP32S2ULP_COMP, 0), NULL_CODE));
			break;
		default:
			fprintf(stderr, "%s:%d:Unknown operator found for arithmetic" " relocation", __FILE__, __LINE__);
		}
		break;
	default:
		fprintf(stderr, "%s:%d:Unknown node expression found during " "arithmetic relocation generation", __FILE__, __LINE__);
	}
	return note;
}

/* Blackfin opcode generation.  */

/* These functions are called by the generated parser
(from esp32s2ulp-parse.y), the register type classification
happens in esp32s2ulp-lex.l.  */

#include "esp32s2ulp-aux.h"
#include "opcode/esp32s2ulp.h"

#define INIT(t)  t c_code = init_##t
#define ASSIGN(x) c_code.opcode |= ((x & c_code.mask_##x)<<c_code.bits_##x)
#define ASSIGNF(x,f) c_code.opcode |= ((x & c_code.mask_##f)<<c_code.bits_##f)

#define GEN_OPCODE32()  \
	conscode (gencode (HI (c_code.opcode)), \
	conscode (gencode (LO (c_code.opcode)), NULL_CODE))

#define GEN_OPCODE16()  \
	conscode (gencode (c_code.opcode), NULL_CODE)


/*  32 BIT INSTRUCTIONS.  */
#define GEN_OPCODE32_DYA(opcode)  \
	conscode (gencode (opcode), NULL_CODE)




INSTR_T
esp32s2ulp_gen_progctrl(int prgfunc, int poprnd)
{
	(void) prgfunc;
	(void) poprnd;
	unsigned int local_op = OP_CMD_WAIT(0);

	return GEN_OPCODE32_DYA(local_op);
}


// =================   ESP32 ===========================================================

INSTR_T esp32s2ulp_gen_alu_ADDR(int dst, int src1, int src2)
{
	//DEBUG_TRACE("dya_pass - esp32s2ulp_gen_alu_add - dst=%i, src1=%i, src2=%i\n", dst, src1, src2);
	unsigned int local_op = I_ALUR(dst, src1, src2, ALU_SEL_ADD);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32s2ulp_gen_alu_r(int dst, int src1, int src2, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32s2ulp_gen_alu_r - dst=%i, src1=%i, src2=%i, op = %i\n", dst, src1, src2, operation);
	unsigned int local_op = I_ALUR(dst, src1, src2, operation);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32s2ulp_gen_alu_i(int dst, int src1, Expr_Node* addr, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32s2ulp_gen_alu_i - dst=%i, src1=%i, operation = %i, type=%i, op_value = %i\n", dst, src1, operation, (int)addr->type, (int)addr->value.op_value);
	int imm_val = EXPR_VALUE(addr);
	unsigned int local_op = I_ALUI(dst, src1, imm_val, operation);
	int rel = BFD_RELOC_ESP32S2ULP_ALUI;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}


INSTR_T esp32s2ulp_gen_jump_r(int dst_reg, int cond)
{
	//DEBUG_TRACE("dya_pass - esp32s2ulp_gen_jump_r - dst_reg=%i, cond=%i\n", dst_reg, cond);
	unsigned int local_op = I_JUMP_RI(dst_reg, 0, cond, 1);
	return GEN_OPCODE32_DYA(local_op);
}
INSTR_T esp32s2ulp_gen_jump_i(Expr_Node* addr, int cond)
{
	int val;
	int rel = 0;

	rel = BFD_RELOC_ESP32S2ULP_16_IMM;

	val = EXPR_VALUE(addr);
	if ((val % 4) != 0) error("%s","Esp32S2Ulp is 32-bit addressing processor. Relative jump value must be divided by 4.");
	unsigned int local_op = I_JUMP_RI(0, val>>2, cond, 0);
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

// Conditions for JUMPS instructions
#define JUMPR_EQ 2 
#define JUMPR_GT 1
#define JUMPR_LT 0
#define JUMPR_LE 3
#define JUMPR_GE 4

INSTR_T esp32s2ulp_cmd_jump_relr(Expr_Node* step, Expr_Node* thresh, int cond)
{
	int step_val = EXPR_VALUE(step);
	int thresh_val = EXPR_VALUE(thresh);
	if ((cond == JUMPR_LE) || (cond == JUMPR_GE)) // EQ == 3, GT = 4
	{
		unsigned int walk_cond = 0;
		unsigned int result_cond = 0;
		if (cond == JUMPR_LE) // EQ
		{
			//	Jumpr   step, threshold, LT
			//	Jumpr   step, threshold, EQ
			walk_cond = JUMPR_LT;
			result_cond = JUMPR_EQ;
		}
		if (cond == JUMPR_GE) // GT
		{
			//	Jumpr   step,  threshold, GT
			//	Jumpr   step, threshold,  EQ

			walk_cond = JUMPR_GT;
			result_cond = JUMPR_EQ;
		}
		unsigned int local_walk = I_JUMP_RELR(thresh_val, walk_cond, step_val>>2);
		if (step_val < 0) step_val = step_val - 4;
		unsigned int local_result = I_JUMP_RELR(thresh_val, result_cond, step_val>>2);

		INSTR_T result = conscode(gencode(local_result), 
					conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP), 
					Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPR_THRESH)));
					
		INSTR_T walk1 = conscode(gencode(local_walk), 
					conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP), 
					Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPR_THRESH)));
					
		INSTR_T last_inst = walk1->next;
		while (last_inst->next)
		{
			last_inst = last_inst->next;
		}
		walk1->mult = 0;
		result->mult = 1;
		last_inst->next = result;
		return walk1;

	} else 
	{
		//DEBUG_TRACE("dya_pass - esp32s2ulp_cmd_jump_relr\n");
		unsigned int local_op = I_JUMP_RELR(thresh_val, cond, step_val>>2);
		return conscode(gencode(local_op), 
					conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP), 
					Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPR_THRESH)));
	}
}


INSTR_T esp32s2ulp_cmd_jump_rels(Expr_Node* step, Expr_Node* thresh, int cond)
{
	int step_val = EXPR_VALUE(step);
	int thresh_val = EXPR_VALUE(thresh);

	{
		unsigned int local_op = I_JUMP_RELS(thresh_val, cond, step_val);

		INSTR_T result = conscode(gencode(local_op),
			conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP),
			Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPS_THRESH)
			)
			);
		
		return result;
	}
		   
