espressif/binutils-esp32ulp/gas/config/tc-esp32s2ulp.c
}
INSTR_T esp32s2ulp_cmd_reg_rd(Expr_Node* addr, Expr_Node* high, Expr_Node* low)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_REG_RD \n");
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);

	if (addr_val > DR_REG_MAX_DIRECT)
	{
		if ((addr_val >= DR_REG_RTCCNTL_BASE) && (addr_val < DR_REG_IO_MUX_BASE))
		{
			addr_val = (addr_val - DR_REG_RTCCNTL_BASE)/4;
		} else {
			error("%s","Register address out of range. Must be 0..0x3ff, or in range of 0x3ff48000 .. 0x3ff49000.");
		}
	}
	unsigned int local_op = I_RD_REG(addr_val, low_val, high_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32S2ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_REG_RW_LOW))));
}

INSTR_T esp32s2ulp_cmd_reg_wr(Expr_Node* addr, Expr_Node* high, Expr_Node* low, Expr_Node* data)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_REG_WR \n");
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int data_val = EXPR_VALUE(data);

	if (addr_val > DR_REG_MAX_DIRECT)
	{
		if ((addr_val >= DR_REG_RTCCNTL_BASE) && (addr_val < DR_REG_IO_MUX_BASE))
		{
			addr_val = (addr_val - DR_REG_RTCCNTL_BASE)/4;
		} else {
			error("%s","Register address out of range. Must be 0..0x3ff, or in range of 0x3ff48000 .. 0x3ff49000.");
		}
	}
	unsigned int local_op = I_WR_REG(addr_val, low_val, high_val, data_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32S2ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(data, BFD_RELOC_ESP32S2ULP_REG_RW_DATA),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_REG_RW_LOW)))));
}

INSTR_T esp32s2ulp_cmd_i2c_rd(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_I2C_RD \n");
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);

	unsigned int local_op = I_I2C_RW(addr_val, 0, low_val, high_val, i2c_sel_val, OPCODE_I2C_RD);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(i2c_addr, BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(i2c_sel, BFD_RELOC_ESP32S2ULP_I2C_RW_SEL),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_I2C_RW_LOW)))));
}
INSTR_T esp32s2ulp_cmd_i2c_wr(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel, Expr_Node* data)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_I2C_RD \n");
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);
	unsigned int data_val = EXPR_VALUE(data);

	unsigned int local_op = I_I2C_RW(addr_val, data_val, low_val, high_val, i2c_sel_val, OPCODE_I2C_WR);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(i2c_addr, BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(i2c_sel, BFD_RELOC_ESP32S2ULP_I2C_RW_SEL),
		conctcode(Expr_Node_Gen_Reloc(data, BFD_RELOC_ESP32S2ULP_I2C_RW_DATA),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_I2C_RW_LOW))))));
}


INSTR_T esp32s2ulp_gen_jump_rels(Expr_Node* addr, int judge, int thresh)
{
	(void) judge;
	(void) thresh;
	int rel = 0;

	rel = BFD_RELOC_ESP32S2ULP_JUMPR;
	unsigned int local_op = 0;// I_JUMP_RELR(0, val, cond, 1);

	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

//#define WR_MEM(dest, src, offs, labl, hl, way, sub) { *(unsigned int*)&(wr_mem ){
INSTR_T esp32s2ulp_wr_mem_stlh(int low_hi, int dst_reg, int src_reg, Expr_Node *offset)
{
    int addr_val = EXPR_VALUE(offset);
    unsigned int local_op = WR_MEM(dst_reg, src_reg, addr_val >> 2, 0, low_hi, 3, 0x4);

    return conscode(gencode(local_op), Expr_Node_Gen_Reloc(offset, BFD_RELOC_ESP32S2ULP_WR_MEM));
}

INSTR_T esp32s2ulp_wr_mem_st32(int dst_reg, int src_reg, Expr_Node *offset, Expr_Node *label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int offset_val = EXPR_VALUE(offset);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, offset_val >> 2, label_val, 0, 0, 0x4);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(offset, BFD_RELOC_ESP32S2ULP_WR_MEM), Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL)));
 }

INSTR_T esp32s2ulp_wr_mem_sti32(int dst_reg, int src_reg, Expr_Node* label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, 0, label_val, 0, 0, 0x1);

	return conscode(gencode(local_op),Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL));
 }

INSTR_T esp32s2ulp_wr_mem_st_l(int low_hi, int dst_reg, int src_reg, Expr_Node* offset, Expr_Node* label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int offset_val = EXPR_VALUE(offset);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, offset_val >> 2, label_val, low_hi, 1, 0x4);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL), Expr_Node_Gen_Reloc(offset, BFD_RELOC_ESP32S2ULP_WR_MEM)));
}

INSTR_T esp32s2ulp_wr_mem_sti_l(int dst_reg, int src_reg, Expr_Node* label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, 0, label_val, 0, 1, 0x1);

	return conscode(gencode(local_op),Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL));
}
INSTR_T esp32s2ulp_wr_mem_sti(int dst_reg, int src_reg)
{
    unsigned int local_op = WR_MEM(dst_reg, src_reg, 0, 0, 0, 3, 0x1);
    return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32s2ulp_wr_mem_offset(Expr_Node* offset)
{
    int addr_val = EXPR_VALUE(offset);
    unsigned int local_op = WR_MEM(0, 0, addr_val >> 2, 0, 0, 0, 0x2);

